### pandas

- 테이블 형태의 데이터를 다루는데 사용하는 데이터 분석 패키지
- 구조
  - Series
  - DataFrame

In [2]:
# !pip install pandas

In [1]:
import pandas as pd

In [ ]:
series = pd.Series([70, 80, 90])
series

0    70
1    80
2    90
dtype: int64

In [4]:
series = pd.Series({"a": 60, "b": 70, "c": 80})
series

a    60
b    70
c    80
dtype: int64

In [5]:
series = pd.Series(data=[70, 80, 90], index=["국어", "수학", "영어"])
series

국어    70
수학    80
영어    90
dtype: int64

In [6]:
series.국어

np.int64(70)

In [8]:
print(series.국어)
print(series.index)
print(series.values)
print(series)

70
Index(['국어', '수학', '영어'], dtype='str')
[70 80 90]
국어    70
수학    80
영어    90
dtype: int64

In [14]:
# 수정
# 인덱스 수정
series.index = ["미술", "음악", "체육"]
series

# dtype : int64 => int 64비트(8byte) 표현 == java long

# 타입 변경
series = series.astype("int32")

In [16]:
# 제거
del series["미술"]
series

음악    80
체육    90
dtype: int32

In [19]:
# dataframe : 표 개념

friend_dict_list = [
    {"name": "John", "age": "26", "job": "student"},
    {"name": "Nate", "age": "34", "job": "teacher"},
    {"name": "Micael", "age": "29", "job": "developer"},
]

In [20]:
friend_df = pd.DataFrame(friend_dict_list)
friend_df

     name age        job
0    John  26    student
1    Nate  34    teacher
2  Micael  29  developer

In [ ]:
dict1 = {"국어": [43, 37, 70], "영어": [96, 40, 70], "수학": [54, 69, 40]}
student_df = pd.DataFrame(dict1)
student_df

   국어  영어  수학
0  43  96  54
1  37  40  69
2  70  70  40

In [22]:
person_df = pd.DataFrame(friend_dict_list, index=["f1", "f2", "f3"])
person_df

      name age        job
f1    John  26    student
f2    Nate  34    teacher
f3  Micael  29  developer

In [25]:
list1 = [[1, 2, 3, 4, 5], [6, 7, 8, 9, 10]]

two_df = pd.DataFrame(list1, index=["yb", "ob"], columns=["c1", "c2", "c3", "c4", "c5"])
two_df

    c1  c2  c3  c4  c5
yb   1   2   3   4   5
ob   6   7   8   9  10

In [ ]:
# ms => cp949등으로 인코딩
sample_df1 = pd.read_csv("./data/sample1.csv", encoding="cp949")
sample_df1

   번호   이름                 가입일시  나이
0   1  김정수  2017-01-19 11:30:00  25
1   2  박민구  2017-02-07 10:22:00  35
2   3  정순미  2017-01-22 09:10:00  33
3   4  김정현  2017-02-22 14:09:00  45
4   5  홍미진  2017-04-01 18:00:00  17
5   6  김순철  2017-05-14 22:33:07  22
6   7  이동철  2017-03-01 23:44:45  27
7   8  박지숙  2017-01-11 06:04:18  30
8   9  김은미  2017-02-08 07:44:33  51
9  10  장혁철  2017-12-01 13:01:11  16

In [34]:
# sample_df2 = pd.read_csv("./data/sample3.csv", encoding="cp949")
# sample_df2 # 구분자가 ,일때는 위처럼 표로 나옴

# delimiter 구분자 기호
# header => html의 th가 뭔지
# index_col => index column있을때 대체
sample_df2 = pd.read_csv(
    "./data/sample3.csv", encoding="cp949", delimiter="|", header=None, index_col=0
)
sample_df2

     1                    2   3
0
1  김정수  2017-01-18 11:30:00  25
2  박민구  2017-02-07 10:22:00  35
3  정순미  2017-01-22 09:10:00  33
4  김정현  2017-02-22 14:30:00  45
5  홍미진  2017-01-18 11:30:00  24
6  이동철  2017-03-01 23:30:00  27
7  김은미  2017-04-01 23:30:00  25

In [38]:
file_df = pd.read_excel("./data/file1.xlsx", header=None)
file_df

Empty DataFrame
Columns: []
Index: []

In [43]:
# 조회
print(friend_df.index)
print(friend_df.columns)
print(friend_df.values)
print(friend_df.age)
print(friend_df["age"])

RangeIndex(start=0, stop=3, step=1)
Index(['name', 'age', 'job'], dtype='str')
[['John' '26' 'student']
 ['Nate' '34' 'teacher']
 ['Micael' '29' 'developer']]
0    26
1    34
2    29
Name: age, dtype: str
0    26
1    34
2    29
Name: age, dtype: str

In [54]:
# 특정 행 정보만 추출 : 슬라이싱
# loc(ation), iloc(index)
print(friend_df.loc[1])
print(friend_df[0:1])
print(friend_df.loc[0:1])

name       Nate
age          34
job     teacher
Name: 1, dtype: str
   name age      job
0  John  26  student
   name age      job
0  John  26  student
1  Nate  34  teacher

In [56]:
print(friend_df.iloc[1])
print(friend_df.iloc[0:1])

name       Nate
age          34
job     teacher
Name: 1, dtype: str
   name age      job
0  John  26  student

In [57]:
student_df

   국어  영어  수학
0  43  96  54
1  37  40  69
2  70  70  40

In [61]:
student_df.loc[2]
student_df.loc[1:2]

   국어  영어  수학
1  37  40  69
2  70  70  40

In [ ]:
student_df.loc[1:2, "국어"]

1    37
2    70
Name: 국어, dtype: int64

In [64]:
student_df.iloc[1:2, 0]

1    37
Name: 국어, dtype: int64

In [65]:
person_df

      name age        job
f1    John  26    student
f2    Nate  34    teacher
f3  Micael  29  developer

In [ ]:
person_df.loc["f1":"f2", "age"]

f1    student
f2    teacher
Name: job, dtype: str

In [71]:
person_df.iloc[0:2, 1]

f1    26
f2    34
Name: age, dtype: str

In [76]:
# friend_df에서 age >= 25 조회
# friend_df[friend_df.age >= "30"].to_excel("./data/dataframe1.xlsx")
friend_df[friend_df.age >= "30"]

   name age      job
1  Nate  34  teacher

In [ ]:
# 25 보다 크고, 이름이 Nate인 사람 조회
friend_df[(friend_df.age > "25") & (friend_df.name == "Nate")]
friend_df.query("age > 25" and "name == 'Nate'")

   name age      job
1  Nate  34  teacher

In [84]:
student_df
student_df[student_df["국어"] > 40]

   국어  영어  수학
0  43  96  54
2  70  70  40

In [101]:
sample_df = pd.read_excel("./data/sample.xlsx", index_col=0)
sample_df
sample_df.head(2)

             대리점 영업사원       전월       금월  TEAM  총 판매수량
Sap Co.
KI1316   경기수원대리점  이기정  1720000  2952000     1     123
KI1451   충청홍성대리점  정미진  4080000  2706000     2     220

In [ ]:
# 총 판매수량 > 250 조회
sample_df[sample_df["총 판매수량"] > 250]

              대리점 영업사원       전월       금월  TEAM  총 판매수량
Sap Co.
KI1534    경기화성대리점  경인선   600000  2214000     1     320
KI2776   경기남양주대리점  김수진  8160000  4352000     2     354
KI3131    경기하남대리점  김민정  2750000  7268000     3     293

In [111]:
# 2~3행 조회, 대리점명, 총 판매수량
sample_df.loc["KI2776":"KI3131", ["대리점", "총 판매수량"]]
sample_df.iloc[1:3, [0, 5]]

             대리점  총 판매수량
Sap Co.
KI1451   충청홍성대리점     220
KI1534   경기화성대리점     320

In [98]:
# 금월 컬럼 조회
sample_df["금월"]

Sap Co.
KI1316    2952000
KI1451    2706000
KI1534    2214000
KI1636    2870000
KI1735    2296000
KI1875    2346000
KI1917    1518000
KI2032    2139000
KI2153    2484000
KI2214    1518000
KI2313     945000
KI2433    1404000
KI2512    2312000
KI2671    4760000
KI2776    4352000
KI2870    3400000
KI2910    4896000
KI3030    3128000
KI3131    7268000
KI3252    4740000
Name: 금월, dtype: int64

In [113]:
# Nate => Torres 변경
friend_df.iloc[1, 0] = "Torres"
friend_df

     name age        job
0    John  26    student
1  Torres  34    teacher
2  Micael  29  developer

In [115]:
# 3번 행 추가
friend_df.loc[3] = ["Alice", "28", "student"]
friend_df

     name age        job
0    John  26    student
1  Torres  34    teacher
2  Micael  29  developer
3   Alice  28    student

In [116]:
# 컬럼 추가
friend_df["addr"] = ["Seoul", "New York", "Tokyo", "Paris"]
friend_df

     name age        job      addr
0    John  26    student     Seoul
1  Torres  34    teacher  New York
2  Micael  29  developer     Tokyo
3   Alice  28    student     Paris

In [ ]:
# 삭제 : drop
friend_df.drop("age", axis=1)

     name        job      addr
0    John    student     Seoul
1  Torres    teacher  New York
2  Micael  developer     Tokyo
3   Alice    student     Paris

In [118]:
friend_df

     name age        job      addr
0    John  26    student     Seoul
1  Torres  34    teacher  New York
2  Micael  29  developer     Tokyo
3   Alice  28    student     Paris

In [119]:
# inplace = True : 원본 변경
friend_df.drop("job", axis=1, inplace=True)

In [120]:
friend_df

     name age      addr
0    John  26     Seoul
1  Torres  34  New York
2  Micael  29     Tokyo
3   Alice  28     Paris

In [121]:
student_df

   국어  영어  수학
0  43  96  54
1  37  40  69
2  70  70  40

In [123]:
student_df["과학"] = [80, 60, 98]
student_df

   국어  영어  수학  과학
0  43  96  54  80
1  37  40  69  60
2  70  70  40  98

In [125]:
student_df.to_csv("./data/student.csv", index=False)